#+SETUPFILE: ~/.emacs.d/org-templates/new-setup/setup-default-with-tweaks.org
# #+SETUPFILE: ~/.emacs.d/org-templates/new-setup/setup-default.org
*** create circle sketch                                                 :ok:
- create a sketch with growing circles and re-evaluate update functions
#+BEGIN_SRC clojure :results silent :show-process nil
(defn my_setup []  {:diam 10 :param1 @param1 :frame-rate 2 :cent-x (/ (q/width) 2) :cent-y (/ (q/height) 2)})
#+END_SRC

#+BEGIN_SRC clojure :results silent :show-process nil
  ;; (defn my_draw [state] (q/frame-rate (:frame-rate state)) (q/background 180))
  (defn my_draw [state]
    (q/frame-rate (:frame-rate state))
    (if (< (:diam state) 1820)
      (do (q/background 180) (q/ellipse (:cent-x state) (:cent-y state) (:diam state) (:diam state)))
      (q/background 10)))
#+END_SRC

#+BEGIN_SRC clojure :results silent :show-process nil
;; (defn my_update [state] (identity state ))
(defn my_update [state] (update state :diam + @param1))
#+END_SRC

#+BEGIN_SRC clojure :results silent :show-process nil
      (q/defsketch change-fr
	:title "Growing circle"
	:setup my_setup
	:update my_update
	:draw my_draw
	;; :features [:keep-on-top]
	:key-pressed (fn keyp [state event] (identity state)) 
	:middleware [m/fun-mode 
  m/pause-on-error
  ]
	:size [800 300]
	;; :keep-on-top true
    )
#+END_SRC

# not so hot cuz static
#+BEGIN_SRC clojure :results silent :show-process t

(defn my_update [state] (assoc state :frame-rate 10))
#+END_SRC

#+BEGIN_SRC clojure :results silent :show-process t
  ;; (defn my_update [state] (do (assoc state :diam 10 :frame-rate 1 :param1 @param1) (update state :diam + @param1)))
  (defn my_update [state] (do (update state :diam + @param1)))
#+END_SRC

#+BEGIN_SRC clojure :results silent :show-process t
;; function defined from reduce clojuredocs
  (defn my_update [state] (update-map-entries state {:diam 10 :frame-rate 1}))
#+END_SRC

#+BEGIN_SRC clojure :results silent :show-process t
;; function defined from reduce clojuredocs
  (defn my_update [state] (do (update-map-entries state {:diam 10 :frame-rate 10}) (update state :diam + @param1)))
#+END_SRC

#+BEGIN_SRC clojure :results silent :show-process t
;; function defined from reduce clojuredocs
  (defn my_update [state] (do (update-map-entries state {:diam 10 :frame-rate 1}) (update state :diam + @param1)))
#+END_SRC



ONLY AFTER SKETCH IS RUNNING!
#+BEGIN_SRC clojure :results output
(println @(:state (meta change-fr)))
#+END_SRC

#+RESULTS:
: {:diam 378.29999999999984, :param1 12.700000000000001, :frame-rate 2, :cent-x 400, :cent-y 150}

*** gen_art19                                                          :good:
Large ~mk-lines-stream~ fun (Inspect values used for centering lines)
#+BEGIN_SRC clojure :results silent :show-process t
(defn mk-lines-stream
    []
    (let [half-width   (/ (q/width) 1.1)
	  half-height  (/ (q/height) 1.1)
	  radius-steps (s/steps (q/random 10) 0.5)
	  angle-steps  (s/steps (q/random 10) 0.5)
	  x-steps      (s/steps (q/random 10) 10.1)
	  x-noises     (map q/noise x-steps)
	  y-steps      (s/steps (q/random 10) 10.1)
	  y-noises     (map q/noise y-steps)
	  angle-noises (map q/noise angle-steps)
	  angle-noises (c/mul-add angle-noises 6 -3)
	  angles       (s/steps (- (/ q/PI 2)) angle-noises)
	  angles       (map #(mod % 360) angles)
	  rads         (map q/radians angles)
	  center-xs    (c/mul-add x-noises @param7 (- half-width @param5))
	  center-ys    (c/mul-add y-noises @param8 (- half-height @param6))
	  radii        (map q/noise radius-steps)
	  radii        (c/mul-add radii 550 1)
	  cos-rads     (map q/cos rads)
	  sin-rads     (map q/sin rads)
	  opp-rads     (map #(+ q/PI %) rads)
	  cos-opp-rads (map q/cos opp-rads)
	  sin-opp-rads (map q/sin opp-rads)
	  x1s          (c/mul-add cos-rads radii center-xs)
	  y1s          (c/mul-add sin-rads radii center-ys)
	  x2s          (c/mul-add cos-opp-rads radii center-xs)
	  y2s          (c/mul-add sin-opp-rads radii center-ys)
	  lines        (map list x1s y1s x2s y2s)]
      (s/seq->stream lines)))

(defn mk-cols-stream
    []
    (let [stroke-cols (s/cycle-between 0 255)]
      (s/seq->stream stroke-cols)))

  (defn setup []
    (q/smooth)
    (q/frame-rate 30)
    (q/background 255)
    (q/no-fill)
    (q/stroke-weight 3)
    (q/set-state! :lines-str (mk-lines-stream)
		  :cols-str (mk-cols-stream)))

#+END_SRC

# Draw function
Revise initial draw to include dusty-synth
#+BEGIN_SRC clojure :results silent :show-process t
  (defn draw []
    (let [lines-str (q/state :lines-str)
	  cols-str  (q/state :cols-str)
	  line-args (lines-str)
	  col       (cols-str)]
      (q/stroke col 60)
      (apply q/line line-args)
;;      ((synth (out 0 (hold (comb-n (rlpf (dust [@param1 15]) (+ 1600 (* @param2 (lf-noise1 [1/3, 1/4]))) (+ 0.01 @param4)) 2 0.1 10) @param3 :done FREE))))
))
#+END_SRC

# sketch macro
Create gen-art 19 sketch
#+BEGIN_SRC clojure :results silent :show-process t
  (q/defsketch gen-art-19
    :title "Wave Clock"
    :setup setup
    :middleware [m/pause-on-error]
    :draw draw
    :size [600 600]

    ;; :size :fullscreen
    :features [
	       ;; :present 
	       :resizable]
    )
#+END_SRC

#+BEGIN_SRC clojure :results output :show-process t
(println @(:state (meta gen-art-19)))
#+END_SRC

#+RESULTS:
: {:cols-str #function[quil.helpers.seqs/seq->stream/fn--772], :lines-str #function[quil.helpers.seqs/seq->stream/fn--772]}

